let listZagalovki = ["Проектирование и наладка","Эксплуатация и техническое обслуживание","Монтаж","Управление строительством","Нестандартное проектирование"];
let listText = [
    "В современных условиях энергостроительства очень важно «правильно начать» и «своевременно закончить» реализацию строительства. Указанное невозможно осуществить без качественной проектной организации, которая в разрабатываемых проектных решениях будет учитывать специфику строительства в регионе, условия режимов электрических сетей, а также будет заинтересована в сокращении сроков пуска и ввода объекта в эксплуатацию. Обычно интерес к объекту у проектной организации заканчивается выполнением авторского надзора за ходом строительства. Анализ реализации инвестиционных программ в электроэнергетике показывает актуальность решения вопросов организационной стыковки проектировщиков и наладчиков, объединения их целей и ответственности. ООО НПП «ОВИСТ» развивает проектно-наладочное направление. Специалисты компании участвуют в «рождении», разработке проектных решений и непосредственно отвечают за пуск объекта. «Проектно-наладочная» структура в полной мере заинтересована в качестве и сроках, как самого проектирования, строительства, так и наладки, ввода объекта в работу. При этом «стираются» многочисленные технические разногласия, требующие урегулирования третьей стороной , возникающие на стройке между проектировщиками и наладчиками, задерживающие ход работ. Принцип «сам спроектировал, сам наладил» позволяет, учитывая нормы проектирования, оперативно решать и воплощать технические задачи на объекте. ООО НПП «ОВИСТ» в рамках своей деятельности собственными силами разрабатывает все разделы проектной и рабочей документации. Наладочный персонал оснащен всеми необходимыми приборами и аттестованной лабораторией.",
    "ООО НПП «ОВИСТ» с 1997 года выполняет работы по техническому обслуживанию и текущему ремонту систем дымоудаления, вентиляции и противопожарной автоматики в жилых домах повышенной этажности, а также на промышленных предприятиях города Москвы и Московской области. В настоящее время ООО НПП «ОВИСТ» осуществляет техническое обслуживание и текущий ремонт систем дымоудаления и противопожарной автоматики в жилых домах повышенной этажности районов Вешняки, Новогиреево, Новокосино и Перово города Москвы по долгосрочным договорам с ГБУ «Жилищник» данных районов, частными управляющими компаниями, отдельными ЖСК и ТСЖ. Заключены договора на техническое обслуживание и текущий ремонт 791 системы ДУ и ППА в многоквартирных домах. ООО НПП «ОВИСТ» имеет четыре производственных участка в четырех районах г. Москвы, обеспечивает оперативное и качественное обслуживание, а также ликвидацию аварийных ситуаций.",
    "В составе ООО НПП «ОВИСТ» работает монтажный участок, укомплектованный необходимыми для производства работ машинами, механизмами, инструментом и приспособлениями. Все работы выполняются компетентным персоналом, постоянно повышающим свою квалификацию, имеющим большой опыт работы в области электроэнергетики, противопожарной безопасности и промышленной вентиляции.",
    "В настоящее время электроэнергетика Российской Федерации остро нуждается в значительном объеме реконструкции и строительства электрических сетей 110-750 кВ по причинам ухудшенного технического состояния, а также дефицита мощностей в отдельных регионах. Объем необходимой реконструкции и строительства соизмерим с государственным планом электрификации России 1920 года. Сегодня на рынке присутствует единичное количество компаний, способных комплексно управлять всеми этапами строительства крупных инфраструктурных электроэнергетических объектов 110-750 кВ, выполняя авторитетное техническое руководство технологическими процессами проектирования, строительства и наладки, обеспечивая собственными специалистами ввод в работу и сдачу в эксплуатацию объекта, организовывая многоуровневые и многопрофильные взаимодействия с Заказчиком, проектными, подрядными организациями и поставщиками. Наибольший интерес данные структуры должны представлять государству и собственникам крупных компаний, выполняющих функции генподрядчиков при строительстве и реконструкции крупных подстанций и линий электропередачи 110 кВ и выше. В ООО НПП «ОВИСТ», сформирована команда отраслевых руководителей и специалистов, основными задачами которой являются: •опробование существующих и новых моделей организации реконструкции и строительства на реальных объектах электроэнергетики в электрических сетях 110 кВ и выше, оценка их эффективности; •разработка и внедрение функции технико-экономического управления; •создание проектных, наладочных и монтажных структур. Существующая команда в жестких экономических и сложных ситуационных условиях организовала проектирование, строительство, наладку и ввод в работу значительного объема реконструкций и строительства объектов электроэнергетики 6-500 кВ",
    "ООО НПП «ОВИСТ» участвует в разработке и создании промышленного оборудования, неоднократно являлась лауреатом различных премий, имеет собственные патенты. В рамках данной деятельности зачастую возникает необходимость в разработке нестандартных проектных решений, проектов организаций работ. ООО НПП «ОВИСТ» считает одним из приоритетных направлений развитие функции «Нестандартного проектирования» и в настоящее время специалисты нашей компании привлекаются для планирования, организации и выполнения нестандартных задач, в которых есть только целевые показатели, а путь реализации и нормы отсутствуют. Для реализации «Нестандартного проектирования» ООО НПП «ОВИСТ» создает рабочие группы специалистов и консультантов, в том числе с привлечением представителей науки."]

let book = document.querySelector(".book");
let Zagalovk = document.querySelector(".book-zag");
let text = document.querySelector(".book-text")
let schiot = document.querySelector(".book-schot")
let n = 0;
schiot.textContent = (n+1)+"/"+listText.length;

book.addEventListener('click', (event)=>{

    let target = event.target;

    if (target.matches(".strelka-right")) {
        n++;
        if (n==listText.length)  n = 0
        Zagalovk.textContent = listZagalovki[n];
        text.textContent = listText[n];
        schiot.textContent = (n+1)+"/"+listText.length;
    }
    if (target.matches(".strelka-left")) {
        n--;
        if (n==-1)  n = listText.length-1;
        Zagalovk.textContent = listZagalovki[n];
        text.textContent = listText[n];
        schiot.textContent = (n+1)+"/"+listText.length;
    }


    
});